// 由 OpenStreetMap 篩出：路線一沿線 500 公尺內的便利店、手搖飲品店、捷運站與出口。
// 2026-10-20 下載（OSM API map 呼叫，四格），由 Claude 篩選；店家可能已搬遷或結業，以現場為準。
// 已剔除「蝦皮店到店」取件點（買不到飲料）。捷運信義安和站中心距路線約 520 公尺，但 3、4、5 號出口在 500 公尺內，所以保留。
// © OpenStreetMap contributors（ODbL）

export const POIS = {
 "stores": [
  {
   "name": "7-Eleven",
   "lat": 25.026178,
   "lng": 121.557384
  },
  {
   "name": "7-Eleven",
   "lat": 25.023993,
   "lng": 121.555652
  },
  {
   "name": "OK超商",
   "lat": 25.023047,
   "lng": 121.555471
  },
  {
   "name": "7-Eleven",
   "lat": 25.031935,
   "lng": 121.558716
  },
  {
   "name": "全家便利商店 世貿店",
   "lat": 25.033259,
   "lng": 121.558919
  },
  {
   "name": "7-Eleven",
   "lat": 25.022125,
   "lng": 121.554641
  },
  {
   "name": "全家便利商店 復昌店",
   "lat": 25.032186,
   "lng": 121.557603
  },
  {
   "name": "7-Eleven 光復門市",
   "lat": 25.033746,
   "lng": 121.557732
  },
  {
   "name": "全家便利商店",
   "lat": 25.028494,
   "lng": 121.557055
  },
  {
   "name": "全家便利商店",
   "lat": 25.02439,
   "lng": 121.553844
  },
  {
   "name": "7-Eleven",
   "lat": 25.03221,
   "lng": 121.55726
  },
  {
   "name": "7-Eleven",
   "lat": 25.031663,
   "lng": 121.55957
  },
  {
   "name": "全家便利商店",
   "lat": 25.031696,
   "lng": 121.55946
  },
  {
   "name": "7-Eleven",
   "lat": 25.028014,
   "lng": 121.556798
  },
  {
   "name": "萊爾富",
   "lat": 25.02965,
   "lng": 121.556229
  },
  {
   "name": "7-Eleven",
   "lat": 25.028183,
   "lng": 121.5565
  },
  {
   "name": "7-Eleven",
   "lat": 25.034303,
   "lng": 121.560061
  },
  {
   "name": "萊爾富 居安店",
   "lat": 25.02089,
   "lng": 121.554952
  },
  {
   "name": "OK超商",
   "lat": 25.021911,
   "lng": 121.556602
  },
  {
   "name": "全家便利商店",
   "lat": 25.030935,
   "lng": 121.560266
  },
  {
   "name": "7-Eleven",
   "lat": 25.031237,
   "lng": 121.561105
  },
  {
   "name": "7-Eleven",
   "lat": 25.025787,
   "lng": 121.554399
  },
  {
   "name": "7-Eleven",
   "lat": 25.025681,
   "lng": 121.551908
  },
  {
   "name": "全家便利商店",
   "lat": 25.030986,
   "lng": 121.561116
  },
  {
   "name": "7-Eleven",
   "lat": 25.024621,
   "lng": 121.550881
  },
  {
   "name": "7-Eleven 安居門市",
   "lat": 25.020388,
   "lng": 121.554408
  },
  {
   "name": "全家便利商店 光復南路店",
   "lat": 25.035188,
   "lng": 121.557707
  },
  {
   "name": "家樂福超市 大安臨江店",
   "lat": 25.03026,
   "lng": 121.554893
  },
  {
   "name": "7-Eleven",
   "lat": 25.020527,
   "lng": 121.556382
  },
  {
   "name": "OK超商",
   "lat": 25.030157,
   "lng": 121.560999
  },
  {
   "name": "全家便利商店 外貿店",
   "lat": 25.034402,
   "lng": 121.562086
  },
  {
   "name": "萊爾富 信義和平東",
   "lat": 25.020442,
   "lng": 121.556888
  },
  {
   "name": "7-Eleven",
   "lat": 25.021944,
   "lng": 121.550961
  },
  {
   "name": "OK超商 信安店",
   "lat": 25.020226,
   "lng": 121.552721
  },
  {
   "name": "OK超商",
   "lat": 25.02131,
   "lng": 121.551393
  },
  {
   "name": "全家便利商店 安居店",
   "lat": 25.019701,
   "lng": 121.553346
  },
  {
   "name": "7-Eleven",
   "lat": 25.029162,
   "lng": 121.561434
  },
  {
   "name": "好鄰居生活百貨",
   "lat": 25.019587,
   "lng": 121.553474
  },
  {
   "name": "家樂福超市",
   "lat": 25.032765,
   "lng": 121.554435
  },
  {
   "name": "7-Eleven 鑫通門市",
   "lat": 25.032538,
   "lng": 121.554389
  },
  {
   "name": "7-Eleven",
   "lat": 25.022606,
   "lng": 121.549842
  },
  {
   "name": "萊爾富 信義興隆店",
   "lat": 25.035948,
   "lng": 121.561092
  },
  {
   "name": "7-Eleven",
   "lat": 25.025333,
   "lng": 121.549534
  },
  {
   "name": "7-Eleven",
   "lat": 25.027501,
   "lng": 121.553593
  },
  {
   "name": "7-Eleven",
   "lat": 25.031388,
   "lng": 121.554169
  },
  {
   "name": "7-Eleven",
   "lat": 25.034306,
   "lng": 121.554407
  },
  {
   "name": "全家便利商店",
   "lat": 25.033683,
   "lng": 121.554171
  },
  {
   "name": "7-Eleven",
   "lat": 25.027427,
   "lng": 121.551602
  },
  {
   "name": "全家便利商店",
   "lat": 25.019941,
   "lng": 121.557584
  },
  {
   "name": "7-Eleven 勤醫門市",
   "lat": 25.027148,
   "lng": 121.562302
  },
  {
   "name": "7-Eleven",
   "lat": 25.025847,
   "lng": 121.562057
  },
  {
   "name": "全家便利商店",
   "lat": 25.036638,
   "lng": 121.55731
  },
  {
   "name": "全家便利商店",
   "lat": 25.025557,
   "lng": 121.549156
  },
  {
   "name": "全家便利商店",
   "lat": 25.03038,
   "lng": 121.553265
  },
  {
   "name": "7-Eleven",
   "lat": 25.030723,
   "lng": 121.55315
  },
  {
   "name": "7-Eleven",
   "lat": 25.036585,
   "lng": 121.555709
  },
  {
   "name": "全家便利商店",
   "lat": 25.024446,
   "lng": 121.548317
  },
  {
   "name": "全家便利商店",
   "lat": 25.032475,
   "lng": 121.553228
  },
  {
   "name": "7-Eleven 敦隆門市",
   "lat": 25.023567,
   "lng": 121.548287
  }
 ],
 "drinks": [
  {
   "name": "信義水果吧",
   "lat": 25.032286,
   "lng": 121.558599
  },
  {
   "name": "50嵐",
   "lat": 25.029222,
   "lng": 121.557517
  },
  {
   "name": "50嵐",
   "lat": 25.031633,
   "lng": 121.559581
  },
  {
   "name": "烏弄",
   "lat": 25.031336,
   "lng": 121.560003
  },
  {
   "name": "蟬吃茶",
   "lat": 25.031326,
   "lng": 121.559773
  },
  {
   "name": "茶湯會",
   "lat": 25.021155,
   "lng": 121.554973
  },
  {
   "name": "CoCo都可",
   "lat": 25.020958,
   "lng": 121.554748
  },
  {
   "name": "牛口水",
   "lat": 25.027729,
   "lng": 121.554686
  },
  {
   "name": "鮮茶道",
   "lat": 25.03047,
   "lng": 121.554386
  },
  {
   "name": "茶的魔手",
   "lat": 25.030092,
   "lng": 121.554274
  },
  {
   "name": "City Milk",
   "lat": 25.029758,
   "lng": 121.554252
  },
  {
   "name": "樺達奶茶",
   "lat": 25.029929,
   "lng": 121.554112
  },
  {
   "name": "一沐日",
   "lat": 25.030183,
   "lng": 121.554126
  },
  {
   "name": "CoCo",
   "lat": 25.03051,
   "lng": 121.55414
  },
  {
   "name": "康青龍",
   "lat": 25.032046,
   "lng": 121.554387
  },
  {
   "name": "大茗本位製茶堂",
   "lat": 25.032489,
   "lng": 121.554172
  },
  {
   "name": "清玉",
   "lat": 25.032011,
   "lng": 121.554142
  },
  {
   "name": "春陽茶事 台北北醫店",
   "lat": 25.02725,
   "lng": 121.562438
  }
 ],
 "mrt": [
  {
   "type": "station",
   "name": "六張犁站",
   "code": "BR07",
   "lat": 25.023818,
   "lng": 121.553121
  },
  {
   "type": "station",
   "name": "台北101/世貿站",
   "code": "R03",
   "lat": 25.032979,
   "lng": 121.562445
  },
  {
   "type": "station",
   "name": "信義安和站",
   "code": "R04",
   "lat": 25.03313,
   "lng": 121.552733
  },
  {
   "type": "exit",
   "name": "六張犁站 出口",
   "lat": 25.023816,
   "lng": 121.552744
  },
  {
   "type": "exit",
   "name": "台北101/世貿站2號出口",
   "lat": 25.032839,
   "lng": 121.561745
  },
  {
   "type": "exit",
   "name": "台北101/世貿站1號出口",
   "lat": 25.033126,
   "lng": 121.561742
  },
  {
   "type": "exit",
   "name": "台北101/世貿站3號出口",
   "lat": 25.032798,
   "lng": 121.563166
  },
  {
   "type": "exit",
   "name": "台北101/世貿站5號出口 (電梯)",
   "lat": 25.033134,
   "lng": 121.563243
  },
  {
   "type": "exit",
   "name": "台北101/世貿站5號出口",
   "lat": 25.033218,
   "lng": 121.563281
  },
  {
   "type": "exit",
   "name": "信義安和站 5號出口",
   "lat": 25.033351,
   "lng": 121.553511
  },
  {
   "type": "exit",
   "name": "信義安和站 4號出口",
   "lat": 25.03304,
   "lng": 121.553454
  },
  {
   "type": "exit",
   "name": "台北101/世貿站4號出口",
   "lat": 25.033341,
   "lng": 121.564421
  },
  {
   "type": "exit",
   "name": "信義安和站 3號出口",
   "lat": 25.033042,
   "lng": 121.553223
  }
 ]
};
