// 路線一沿線 500 公尺內的便利商店、手搖飲料店、捷運站與出口。
// 便利商店與飲料店 2026-10-21 改用各品牌官方門市查詢重新整理（7-ELEVEN、全家、萊爾富、OK超商；
// 50嵐、清心福全、可不可、鮮茶道、迷客夏、麻古、五桐號），官網查不到的店一律不列，以免帶人走到已結業的店。
// 萊爾富、OK 與部分飲料店官網沒有座標，依門牌定位，位置為大約。
// 捷運站與出口沿用 2026-10-20 OpenStreetMap 資料（© OpenStreetMap contributors，ODbL）。

export const POIS = {
 "stores": [
  {
   "name": "7-ELEVEN 崇德門市",
   "lat": 25.024082,
   "lng": 121.555603
  },
  {
   "name": "7-ELEVEN 和安門市",
   "lat": 25.02222,
   "lng": 121.554624
  },
  {
   "name": "7-ELEVEN 中興門市",
   "lat": 25.031971,
   "lng": 121.558791
  },
  {
   "name": "7-ELEVEN 復嘉門市",
   "lat": 25.030039,
   "lng": 121.55722
  },
  {
   "name": "7-ELEVEN 犁耘門市",
   "lat": 25.027337,
   "lng": 121.558717
  },
  {
   "name": "全家 財盛店",
   "lat": 25.028657,
   "lng": 121.557184
  },
  {
   "name": "全家 復昌店",
   "lat": 25.032031,
   "lng": 121.557596
  },
  {
   "name": "全家 臨江店",
   "lat": 25.02933,
   "lng": 121.556974
  },
  {
   "name": "7-ELEVEN 光復門市",
   "lat": 25.033679,
   "lng": 121.557644
  },
  {
   "name": "7-ELEVEN 復昌門市",
   "lat": 25.032264,
   "lng": 121.557335
  },
  {
   "name": "全家 崇德店",
   "lat": 25.024369,
   "lng": 121.553809
  },
  {
   "name": "全家 三興店",
   "lat": 25.031759,
   "lng": 121.559466
  },
  {
   "name": "7-ELEVEN 松敬門市",
   "lat": 25.031691,
   "lng": 121.559623
  },
  {
   "name": "全家 安信店",
   "lat": 25.027346,
   "lng": 121.55934
  },
  {
   "name": "萊爾富 大安臨江店",
   "lat": 25.029613,
   "lng": 121.556408
  },
  {
   "name": "7-ELEVEN 昌隆門市",
   "lat": 25.028011,
   "lng": 121.55673
  },
  {
   "name": "7-ELEVEN 欣隆昌門市",
   "lat": 25.028387,
   "lng": 121.556496
  },
  {
   "name": "7-ELEVEN 凱悅門市",
   "lat": 25.034285,
   "lng": 121.560031
  },
  {
   "name": "萊爾富 大安安居店",
   "lat": 25.021065,
   "lng": 121.554882
  },
  {
   "name": "OK超商 信義富陽店",
   "lat": 25.021912,
   "lng": 121.556517
  },
  {
   "name": "7-ELEVEN 興貿門市",
   "lat": 25.031145,
   "lng": 121.561036
  },
  {
   "name": "7-ELEVEN 喬治門市",
   "lat": 25.025803,
   "lng": 121.554413
  },
  {
   "name": "7-ELEVEN 樂利門市",
   "lat": 25.025782,
   "lng": 121.55191
  },
  {
   "name": "7-ELEVEN 安居門市",
   "lat": 25.020451,
   "lng": 121.554426
  },
  {
   "name": "7-ELEVEN 國貿門市",
   "lat": 25.034597,
   "lng": 121.560995
  },
  {
   "name": "全家 景聯店",
   "lat": 25.030796,
   "lng": 121.56113
  },
  {
   "name": "7-ELEVEN 技安門市",
   "lat": 25.024613,
   "lng": 121.550779
  },
  {
   "name": "全家 光復南路店",
   "lat": 25.035201,
   "lng": 121.557647
  },
  {
   "name": "7-ELEVEN 和樂門市",
   "lat": 25.02064,
   "lng": 121.553285
  },
  {
   "name": "7-ELEVEN 富陽門市",
   "lat": 25.020683,
   "lng": 121.556246
  },
  {
   "name": "全家 富興店",
   "lat": 25.028813,
   "lng": 121.560954
  },
  {
   "name": "OK超商 信義吳興四店",
   "lat": 25.030125,
   "lng": 121.56093
  },
  {
   "name": "7-ELEVEN 世貿門市",
   "lat": 25.033867,
   "lng": 121.562325
  },
  {
   "name": "7-ELEVEN 世貿二門市",
   "lat": 25.033867,
   "lng": 121.562325
  },
  {
   "name": "7-ELEVEN 樂安門市",
   "lat": 25.02197,
   "lng": 121.550849
  },
  {
   "name": "萊爾富 信義和平東",
   "lat": 25.020419,
   "lng": 121.556979
  },
  {
   "name": "7-ELEVEN 三興門市",
   "lat": 25.029186,
   "lng": 121.561392
  },
  {
   "name": "全家 安居店",
   "lat": 25.019677,
   "lng": 121.553268
  },
  {
   "name": "7-ELEVEN 鑫通門市",
   "lat": 25.032581,
   "lng": 121.554419
  },
  {
   "name": "萊爾富 信義興隆店",
   "lat": 25.035948,
   "lng": 121.561092
  },
  {
   "name": "7-ELEVEN 樂隆門市",
   "lat": 25.022688,
   "lng": 121.549609
  },
  {
   "name": "7-ELEVEN 通化門市",
   "lat": 25.031426,
   "lng": 121.554216
  },
  {
   "name": "7-ELEVEN 敦禾門市",
   "lat": 25.025448,
   "lng": 121.549574
  },
  {
   "name": "7-ELEVEN 信義門市",
   "lat": 25.034224,
   "lng": 121.554413
  },
  {
   "name": "7-ELEVEN 貿捷門市",
   "lat": 25.032678,
   "lng": 121.563651
  },
  {
   "name": "全家 義和店",
   "lat": 25.033721,
   "lng": 121.554171
  },
  {
   "name": "7-ELEVEN 華電門市",
   "lat": 25.027566,
   "lng": 121.553541
  },
  {
   "name": "7-ELEVEN 鑫麟門市",
   "lat": 25.020399,
   "lng": 121.558375
  },
  {
   "name": "7-ELEVEN 仁和門市",
   "lat": 25.036561,
   "lng": 121.558423
  },
  {
   "name": "全家 光新店",
   "lat": 25.036554,
   "lng": 121.557358
  },
  {
   "name": "7-ELEVEN 樂和門市",
   "lat": 25.02742,
   "lng": 121.551507
  },
  {
   "name": "7-ELEVEN 北醫大門市",
   "lat": 25.026987,
   "lng": 121.562224
  },
  {
   "name": "全家 六張黎店",
   "lat": 25.019886,
   "lng": 121.55755
  },
  {
   "name": "7-ELEVEN 勤醫門市",
   "lat": 25.027229,
   "lng": 121.562267
  },
  {
   "name": "全家 新遠企店",
   "lat": 25.02559,
   "lng": 121.549089
  },
  {
   "name": "全家 通和店",
   "lat": 25.030322,
   "lng": 121.553276
  },
  {
   "name": "全家 台北１０１店",
   "lat": 25.034089,
   "lng": 121.563859
  },
  {
   "name": "7-ELEVEN 臨通門市",
   "lat": 25.030757,
   "lng": 121.553189
  },
  {
   "name": "7-ELEVEN 延吉門市",
   "lat": 25.036636,
   "lng": 121.555705
  },
  {
   "name": "全家 通昌店",
   "lat": 25.032471,
   "lng": 121.553157
  },
  {
   "name": "全家 和茂店",
   "lat": 25.024421,
   "lng": 121.548157
  }
 ],
 "drinks": [
  {
   "name": "50嵐 世貿店",
   "lat": 25.031554,
   "lng": 121.559491
  },
  {
   "name": "清心福全 和平東店",
   "lat": 25.02069,
   "lng": 121.55618
  },
  {
   "name": "可不可熟成紅茶 台北通化店",
   "lat": 25.02994,
   "lng": 121.554294
  },
  {
   "name": "麻古茶坊 台北通化店",
   "lat": 25.030017,
   "lng": 121.554265
  },
  {
   "name": "鮮茶道 北市通化店",
   "lat": 25.030473,
   "lng": 121.554331
  },
  {
   "name": "五桐號 台北通化旗艦店",
   "lat": 25.030871,
   "lng": 121.554357
  },
  {
   "name": "50嵐 通化店",
   "lat": 25.029365,
   "lng": 121.554086
  },
  {
   "name": "清心福全 世貿店",
   "lat": 25.029496,
   "lng": 121.561536
  },
  {
   "name": "迷客夏 臺北北醫莊敬店",
   "lat": 25.029113,
   "lng": 121.562482
  }
 ],
 "mrt": [
  {
   "type": "station",
   "name": "六張犁站",
   "code": "BR07",
   "lat": 25.023818,
   "lng": 121.553121
  },
  {
   "type": "station",
   "name": "台北101/世貿站",
   "code": "R03",
   "lat": 25.032979,
   "lng": 121.562445
  },
  {
   "type": "station",
   "name": "信義安和站",
   "code": "R04",
   "lat": 25.03313,
   "lng": 121.552733
  },
  {
   "type": "exit",
   "name": "六張犁站 出口",
   "lat": 25.023816,
   "lng": 121.552744
  },
  {
   "type": "exit",
   "name": "台北101/世貿站2號出口",
   "lat": 25.032839,
   "lng": 121.561745
  },
  {
   "type": "exit",
   "name": "台北101/世貿站1號出口",
   "lat": 25.033126,
   "lng": 121.561742
  },
  {
   "type": "exit",
   "name": "台北101/世貿站3號出口",
   "lat": 25.032798,
   "lng": 121.563166
  },
  {
   "type": "exit",
   "name": "台北101/世貿站5號出口 (電梯)",
   "lat": 25.033134,
   "lng": 121.563243
  },
  {
   "type": "exit",
   "name": "台北101/世貿站5號出口",
   "lat": 25.033218,
   "lng": 121.563281
  },
  {
   "type": "exit",
   "name": "信義安和站 5號出口",
   "lat": 25.033351,
   "lng": 121.553511
  },
  {
   "type": "exit",
   "name": "信義安和站 4號出口",
   "lat": 25.03304,
   "lng": 121.553454
  },
  {
   "type": "exit",
   "name": "台北101/世貿站4號出口",
   "lat": 25.033341,
   "lng": 121.564421
  },
  {
   "type": "exit",
   "name": "信義安和站 3號出口",
   "lat": 25.033042,
   "lng": 121.553223
  }
 ]
};
